export let host: string = `${document.location.protocol.slice(0, -1)}://${document.location.host.split(':')[0]}`

if (document.location.host.split(':')[1]) {
    if (document.location.host.split(':')[1] !== '3000')
        host += ':' + document.location.host.split(':')[1]
    else
        host += ':8081'
} else
    host += ''

export const roomStatuses = [
    {id: 1, name: "Свободно"},
    {id: 2, name: "Занято"},
    {id: 3, name: "Комната выкуплена организацией"},
]

export const flatStatuses = [
    {id: 1, name: "Свободно"},
    {id: 2, name: "Занято"},
    {id: 4, name: "Секция выкуплена организацией"},
]

export const uttistCehs = [
    {id: 1, name: "НАТЦ"},
    {id: 2, name: "САТЦ"},
    {id: 3, name: "ТАТЦ"},
]

export const ukgBosses = [
    "Ричак Роман Васильевич",
    "Непогода Андрей Владимирович",
    "Рябуха Марина Александровна",
    "Свердлова Екатерина Петровна",
    "Ларина Оксана Викторовна",
    "Нестерова Оксана Ивановна",
    "Галицкая Валентина Степановна",
    "Латышева Ирина Ильдусовна",
    "Руденко Наталья Алексеевна",
    "Белка Валентина Николаевна",
    "Сартисон Оксана Александровна",
    "Гасенко Ирина Александровна",
    "Леонова Юлия Алексеевна",
    "Могрицкая Ольга Николаевна",
    "Дасаева Инна Викторовна",
    "Новикова Оксана Викторовна",
    "Сидорова Юлия Владимировна",
    "Фомин Виталий Николаевич",
    "Боброва Наталья Александровна",
    "Манцова Алена Викторовна",
    "Бровин Евгений Юрьевич",
    "Антонов Сергей Александрович",
    "Халтурина Галина Петровна",
    "Ненастьева Ольга Геннадьевна",
    "Бондаренко Лариса Викторовна",
]